#Мета: розробити програму, яка дозволяє користувачеві конвертувати гривні в інші валюти (наприклад, євро та долари).
#Основні функції
#Введення суми:Користувач вводить суму в гривнях, яку потрібно конвертувати.
#Вибір валюти:Користувач вибирає валюту для конвертації:Євро (EUR) Долар США (USD)
#Конвертація:Програма виконує конвертацію на основі фіксованого курсу
#Виводить результат конвертації.
#Обробка помилок: Якщо введено нечислове значення або порожній рядок, вивести повідомлення про помилку.
# Якщо вибрана неіснуюча валюта, вивести повідомлення про помилку.
exr=[1.0,       #uah
     42.95,     #eu
     51.58,     #pound
     41.65,     #usd
     5.70,      #ch-uan
     0.27]      #j-yen
currencylist = ["Гривень","Євро","Фунтів Стерлінгів","Долларів США","Китайських Юанів","Японських Єн"]
try:
    currencyin = int(input("Введіть число для вибору валюти до конвертації:\n"
                           "1 для гривні\n"
                           "2 для євро\n"
                           "3 для фунта стерлінга\n"
                           "4 для долара сша\n"
                           "5 для китайського юаня\n"
                           "6 для японської єни\n"))
    currencyout = int(input("Введіть число для вибору валюти після конвертації:\n"
                            "1 для гривні\n"
                            "2 для євро\n"
                            "3 для фунта стерлінга\n"
                            "4 для долара сша\n"
                            "5 для китайського юаня\n"
                            "6 для японської єни\n"))
    amountin = float(input("Вкажіть кількість грошей що підлягає конвертації: "))
except ValueError:
    print("Це не число")
else:
    try:
        amountout = amountin*(exr[currencyin-1]/exr[currencyout-1])
        print(f"{amountin} {currencylist[currencyin-1]} рівне {round(amountout,2)} {currencylist[currencyout-1]}")
    except IndexError:
        print("Ваше число валюти поза списком")
